# Use Case

Importamos las librerías y funciones necesarias

In [67]:
import tensorflow as tf
import pandas as pd
import skmob

from skmob.measures.individual import home_location
from skmob.io.file import load_geolife_trajectories


Cargamos el dataset usando la función 'load_geolife_trajectories' que nos proporciona skmob. Esta función se encarga de cargar los datos de GeoLife Trajectories, solo hay que indicarle el path del directorio Data, y los usuarios que queremos cargar. Es opcional pasarle algunos parámetros de filtrado y compresión.

In [94]:
path = "/home/alonso/Documentos/tfg/Geolife_Trajectories/"
traj_df = load_geolife_trajectories(path, user_ids=['000'],compress_kwargs={'spatial_radius_km': 0.5})

In [95]:
print(type(traj_df))
traj_df.head()

<class 'skmob.core.trajectorydataframe.TrajDataFrame'>

         lat         lng            datetime  uid
0  39.984574  116.315407 2008-10-23 02:53:04  000
1  39.984525  116.309503 2008-10-23 02:56:10  000
2  39.984367  116.303742 2008-10-23 02:59:15  000
3  39.983680  116.299314 2008-10-23 03:01:55  000
4  39.996305  116.286122 2008-10-23 04:08:07  000

In [116]:

df = pd.DataFrame(traj_df)
print(type(df))
print(df.count())
df.head()

<class 'pandas.core.frame.DataFrame'>
lat         4183
lng         4183
datetime    4183
uid         4183
at_home     4183
dtype: int64

       lat      lng             datetime  uid at_home
0  39.9846  116.315  2008-10-23 02:53:04  000      no
1  39.9845   116.31  2008-10-23 02:56:10  000      no
2  39.9844  116.304  2008-10-23 02:59:15  000      no
3  39.9837  116.299  2008-10-23 03:01:55  000      no
4  39.9963  116.286  2008-10-23 04:08:07  000      no

In [98]:

home_loc_df = home_location(df)
home_loc_df.head()

100%|██████████| 1/1 [00:00<00:00, 104.26it/s]

   uid        lat         lng
0  000  31.097317  121.055134

In [99]:
mergedStuff = pd.merge(home_loc_df, df, on=['lng','lat'])
mergedStuff.head()

  uid_x        lat         lng            datetime uid_y  at_home
0   000  31.097317  121.055134 2009-06-28 03:43:02   000        0

In [135]:
df['at_home'] = 0


df.loc[df['lat'].isin(home_loc_df['lat']), 'at_home'] = 1


df[df['at_home'] == 0].count()

lat         4183
lng         4183
datetime    4183
uid         4183
at_home     4183
dtype: int64

In [152]:
data_list1 = [[39.984094, 116.319236, '2008-10-23 13:53:05', '000'],
             [39.984198, 116.319322, '2008-10-23 13:53:06', '000'],
             [39.984094, 116.319236, '2008-10-23 13:53:11', '000'],
             [39.984123, 116.319437, '2008-10-23 13:53:11', '000'],
             [39.984324, 116.319421, '2008-10-23 13:53:11', '000']]
data_columns  = ['lat', 'lng', 'datetime', 'uid']

In [173]:

df_test1 = pd.DataFrame(data_list1, columns=data_columns)
df_test1['at_home'] = 0
df_test1

         lat         lng             datetime  uid  at_home
0  39.984094  116.319236  2008-10-23 13:53:05  000        0
1  39.984198  116.319322  2008-10-23 13:53:06  000        0
2  39.984094  116.319236  2008-10-23 13:53:11  000        0
3  39.984123  116.319437  2008-10-23 13:53:11  000        0
4  39.984324  116.319421  2008-10-23 13:53:11  000        0

In [174]:
data_list2 = [[39.984094, 116.319236, '2008-10-23 13:53:05', '000']]
data_columns  = ['lat', 'lng', 'datetime', 'uid']
df_test2 = pd.DataFrame(data_list2, columns=data_columns)
df_test2.head()

         lat         lng             datetime  uid
0  39.984094  116.319236  2008-10-23 13:53:05  000

In [177]:
df_final = pd.merge(df_test1, df_test2, on=['lat','lng','uid'],how='left')
df_final.head()

,lat,lng,datetime_x,uid,at_home,datetime_y
0,39.984094,116.319236,2008-10-23 13:53:05,000,0,2008-10-23 13:53:05
1,39.984198,116.319322,2008-10-23 13:53:06,000,0,NaN
2,39.984094,116.319236,2008-10-23 13:53:11,000,0,2008-10-23 13:53:05
3,39.984123,116.319437,2008-10-23 13:53:11,000,0,NaN
4,39.984324,116.319421,2008-10-23 13:53:11,000,0,NaN

In [168]:


df_test1.loc[(df_test1['lat'] == 39.984094) & (df_test1['lng'] == 116.319236 ), 'at_home'] = 1
df_test1.head()

         lat         lng             datetime  uid  at_home
0  39.984094  116.319236  2008-10-23 13:53:05  000        1
1  39.984198  116.319322  2008-10-23 13:53:06  000        0
2  39.984094  116.319236  2008-10-23 13:53:11  000        1
3  39.984123  116.319437  2008-10-23 13:53:11  000        0
4  39.984324  116.319421  2008-10-23 13:53:11  000        0

In [ ]:
df_test1['at_home'] = 0

df1['feat'] = np.where(df1['stream'] == 2, 10,20)